Repository: Pat-Vdv/Aude
Catalog: l10n/po/*/automatadesigner.po
Languages: fr

source: New transition
fr: Nouvelle transition

source: Name of the state
fr: Nom de l’état

source: Please give a comma-separated list of labels. You can suround special characters with simple or double quotes.
fr: Veuillez donner les symboles de la transition en les séparant par des vigules. Vous pouvez encadrer les caractères spéciaux par des guillemets simples ou doubles.

source: Sorry, but you can't remove the initial state.
fr: Désolé, mais vous ne pouvez pas supprimer l’état initial.

source: Which name do you want for the state?
fr: Quel nom voulez-vous donner à l’état ?

source: Sorry, but a state is already named like this.
fr: Désolé, mais un état porte déjà ce nom.

source: Sorry, there is already a transition between these states in this way.
fr: Désolé, il y a déjà une transition dans ce sens entre ces états.

source: New state
fr: Nouvel état

source: Toggle accepting
fr: Accepteur / non accepteur

source: Rename
fr: Renommer

source: Make initial
fr: Rendre initial

source: Delete
fr: Supprimer

source: Modify symbols
fr: Modifier les symboles

source: Make straight
fr: Rendre droite

source: Click on the destination state of the new transition.
fr: Cliquez sur l'état de destination de la nouvelle transition.

source: Click where you want to place the new state.
fr: Cliquez à l'endroit où vous souhaitez placer le nouvel état.

source: Cancel
fr: Annuler

source: Sorry! the transition “{2}” from state “{0}” to state “{1}” could not be understood. Please check that the transition is a comma separated symbol list. Special characters must be put inside quotes (' or ").
fr: Désolé ! la transition « {2} » de l'état « {0} » à l'état « {1} » n'a pas été comprise. Veuillez vérifier que la transition est une liste de symboles séparés par des virgules. Les caractères spéciaux doivent être placés entre guillemets (' ou ").
