Repository: Pat-Vdv/Aude
Catalog: l10n/po/*/gui.po
Languages: fr

source: Write the regular expression corresponding to the following automaton
fr: Ecriver l'expression régulière correspondant à l'automate

source: Give the automaton corresponding to the following RE
fr: Donner l'automate correspondant à l'expression régulière

source: Give the automaton corresponding to the following right linear grammar
fr: Dessiner l'automate correspondant à la grammaire linéaire

source: Give the linear grammar corresponding to the following automaton
fr: Donner la grammaire linéaire correspondant à l'automate

source: Give the right linear grammar corresponding to the following left linear grammar
fr: Donner la grammaire linéaire à droite correspondant à la grammaire linéaire à gauche suivante

source: Settings
fr: Options

source: Close the question list
fr: Fermer la page

source: No chapter selected.
fr: Aucun chapitre sélectionné

source: Question List
fr: List de quesitions

source: Setting for the questions
fr: Option pour les questions

source: Automaton1
fr: Automate 1

source: Automaton2
fr: Automate 2

source: Regular expression
fr: Expression régulière

source: Grammar
fr: Grammaire

source: Select file
fr: Fichier sélectionné

source: Generate randomly
fr: Génération aléatoire

source: Get random files
fr: Sélection aléatoire de fichiers

source: Automaton generated randomly
fr: Automate généré aléatoirement

source: Number of states:
fr: Nombre d'états :

source: Number of accepting states:
fr: Nombre d'états accepteurs :

source: Number of transitions:
fr: Nombre de transitions :

source: Automaton selection
fr: Automate sélectionné

source: Select an automaton from the list or from your computer
fr: Choisissez un automate à partir de la liste déjà fournie or depuis votre ordinateur

source: Open automaton
fr: Charger un automate

source: Selected automaton:
fr: Sélectionner un automate :

source: none
fr: aucun

source: The automaton is selected randomly from files
fr: L'automate est sélectionné aléatoirement à partir des fichiers

source: Regular expression generated randomly
fr: L'expression régulière est générée aléatoirement

source: Create a random automaton by using the pararametes of the automaton 1 and converts it to a RE
fr: Génère aléatoirement un automate en utilisant les paramètres de l'automate 1 et le convertit en expression régulière

source: Prefearbly select a regular expression from files
fr: Il vaut mieux sélectionner une expression régulière à partir des fichiers

source: Regular expression selection
fr: Sélection d'expression régulière

source: Select a regular expression from the list or from your computer
fr: Choisissez une expression régulière à partir de la liste déjà fournie or depuis votre ordinateur

source: Open regular expression
fr: Charger une expression régulière

source: Selected regular expression:
fr: Choisissez une expression régumière

source: The regular expression is selected randomly from files
fr: L'expression régulière est sélectionnée aléatoirement à partir des fichiers

source: Grammar generated randomly
fr: Grammaire générée aléatoirement

source: Prefearbly select a grammar from files
fr: Il vaut mieux séléctionner une grammaire à partir des fichiers

source: Grammar selection
fr: Sélection de grammaire

source: Select a grammar from the list or from your computer
fr: Choisissez une grammaire à partir de la liste déjà fournie ou depuis votre ordinateur

source: Open grammar
fr: Ouvri une grammaire

source: Selected grammar:
fr: Grammaire choisie

source: The grammar is selected randomly from files
fr: La grammaire est sélectionnée aléatoirement à parir des fichiers

source: Save and exit
fr: Sauvegarder et quitter

source: Unable to get the list of needed files
fr: Impossible de charger la liste des fichiers

source: Load a file
fr: Charger un fichier

source: List of questions
fr: Liste des questions

source: List of automata
fr: Liste des automates

source: Multiple choice questions
fr: Question à choix multiples

source: Complement the automaton
fr: Complémenter l'automate

source: Complete the automaton
fr: Compléter l'automate

source: Do the product of 2 automata
fr: Faire le produit de 2 automates

source: Minimize the automaton
fr: Minimiser l'automate

source: List all the equivalent states
fr: Lister les états équivalents

source: Equivalency between 2 automata
fr: Equivalence entre automates

source: Give the tabular form of the automaton
fr: Donner la forme tabulaire de l'automate

source: Give the automaton from the table
fr: Donner l'automate correspondant au tableau

source: Give a word recognized by the automata
fr: Donner un mot reconnu par l'automate

source: Determinize the automaton
fr: Déterminiser l'automate

source: Determinize and minimize the automaton
fr: Déterminiser et minimiser l'automate

source: Eliminate the ε-transitions
fr: Eliminer les ε-transitions transitions

source: Determinize and eliminate the ε-transitions
fr: Eliminer les ε-transitions transitions et déterminiser

source: Give a RE which corresponds to the automaton
fr: Donner une expression régulière correspondant à l'automate

source: Give the automaton corresponding to the RE
fr: Donner l'automate correspondant à l"expression régulière

source: Give the automaton corresponding to the right linear grammar
fr: Donner l'automate correspondant à la grammaire linéaire

source: Give the right linear grammar corresponding to the automaton
fr: Donner la grammaire linéaire à droite correspondant à l'automate

source: Convert the left linear grammar to the right linear grammar
fr: Convertir la grammaire linéaire à gauche vers la grammaire linéaire à droite

source: No question
fr: Aucune question

source: Menu questions
fr: Menu

source: Restart
fr: Recommencer

source: Display response
fr: Afficher la réponse

source: Wrong answer
fr: Réponse fausse

source: Correct answer
fr: Réponse correcte

source: Automaton determinist: 1 Automaton non determinist: 2 Automaton non determinist with ε-transitions: 3
fr: Automate deterministe: 1 Automate non deterministe: 2 Automate non deterministe avec ε-transitions: 3

source: Pushdown automaton
fr: Automate à pile

source: Deterministic finite state machines
fr: Automate à états finis déterministe

source: Non-deterministic finite state machines
fr: Automate à états finis non-déterministe

source: Non-deterministic finite state machines with ε-transitions
fr: Automates à états finis non-déterministes avec ε-transitions

source: Regular expressions and Kleene theorem
fr: Expressions régulières et théorème de Kleene

source: Grammars and regular grammars
fr: Grammaires et grammaires régulières

source: Non-regular langages and iterative lemma
fr: Langages non régulier et lemme de l'itération

source: Concatenate 2 automata
fr: Concaténer 2 automates

source: Create intermediate states
fr: Créer des états intermédiares

source: Difference
fr: Différence

source: Left linear grammar → Right linear grammar
fr: Grammaire linéaire à gauche → Grammaire linéaire à droite

source: Linear grammar → Automaton
fr: Grammaire linéaire → Automate

source: Right linear grammar → Left linear grammar
fr: Grammaire linéaire à droite → Grammaire linéaire à gauche

source: Smaller word
fr: Plus petit mot

source: Table representation → automaton
fr: Tableau → automate

source: Union of 2 automata
fr: Union de 2 automates

source: Automaton → Right linear grammar
fr: Automate → Grammaire linéaire à droite

source: Create automaton
fr: Créer un automate

source: Questions list
fr: Liste de questions

source: Start
fr: Commencer

source: Stop
fr: Arréter

source: Next step
fr: Pas suivant

source: Previous step
fr: Pas précédent

source: Search
fr: Parcours

source: Select the start state of the search:
fr: Choisissez l'état de départ:

source: Animate the search
fr: Animer le parcours

source: Breadth first search
fr: Parcours en largeur

source: Depth first search
fr: Parcours en profondeur

source: All states are reachable:
fr: Tous les états sont accessibles :

source: All states are co-reachable:
fr: Tous les états sont co-accessibles :

source: Enter couples of states
fr: Saisissez des couples d'états

source: Enter the answer here
fr: Sasissez la réponse ici

source: File list
fr: Liste des fichiers

source: How to draw automata?
fr: Comment dessiner des automates ?

source: To add a new state, double-click where you want the state to be.
fr: Pour ajouter un nouvel état, double-cliquez là où vous voulez le placer.

source: To rename a state, to modify symbols of a transition, double-click on it.
fr: Pour renommer un état, pour modifier les symboles d'une transition, double-cliquez dessus.

source: To set a state as the initial state, ctrl+right click on the state.
fr: Pour rendre un état initial, ctrl-cliquez dessus avec le bouton droit de votre souris.

source: To remove a state or a transition, ctrl-click on it.
fr: Pour supprimer un état ou une transition, ctrl-cliquez dessus.

source: Help
fr: Aide

source: Other
fr: Autre

source: Automata
fr: Automates

source: Unit tests for Aude
fr: Tests unitaires pour Aude

source: Enter the regular expression you want to translate into an automaton. Recursive syntax: — a is a regular expression (simple character) — \e and ε are regular expressions (epsilon) — r1 + r2 is a regular expression (union) — r1r2, r1.r2 and r1·r2 are regular expressions (contatenation) — r* is a regular expression (Kleene star) Parentheses can be used.
fr: Saisissez l’expression régulière que vous souhaitez traduire en automate. Syntaxe récursive : — a est une expression régulaire (caractère simple) — \e et ε sont des expressions régulières (epsilon) — r1 + r2 est une expression régulière (union) — r1r2, r1.r2 et r1·r2 sont des expressions régulières (contaténation) — r* est une expression régulière (étoile de Kleene) Les parenthèses peuvent être utilisées.
