Repository: Pat-Vdv/Aude
Catalog: l10n/po/*/gui.po
Languages: fr

source: Program Result
fr: Résultat

source: Stack trace:
fr: Pile de l’erreuru202F:

source: Error on line {0}, character {1}
fr: Erreur ligne {0}, caractère {1}

source: Error on line {0}
fr: Erreur à la ligne {0}

source: Execute the current automaton with a word
fr: Exécuter l’automate actuel sur un mot

source: Which name do you want to give to the exported file? (give a .dot extension to save as dot format, .svg to save as svg, .txt to save as automaton code)
fr: Quel nom voulez-vous donner au fichier exportéu202F? (donnez l’extension .dot pour enregistrer au format dot, .svg pour une image svg, .txt pour le format texte)

source: Which name do you want to give to the exported text file?
fr: Quel nom voulez-vous donner au fichier texte exportéu202F?

source: get_automaton: automaton n°{0} could not be understood.
fr: get_automaton: impossible de lire l’automate n°{0}.

source: get_automaton: automaton n°{0} doesn’t exist or doesn’t have an initial state.
fr: get_automaton: l’automate n°{0} n’existe pas ou n’a pas d’état initial.

source: Please enter a name for the file in which the program will be saved.
fr: Veuillez saisir un nom pour le fichier dans lequel le programme sera enregistré.

source: Please enter a name for the file in which the automaton will be saved (give a .dot extension to save as dot format, .svg to save as svg, .txt to save in Aude format).
fr: Veuillez saisir un nom pour le fichier dans lequel l’automate sera enregistré (donnez l’extension .dot pour enregistrer au format dot, .svg pour une image svg, .txt pour le format Aude).

source: Syntax error: bad import parameter in {0}
fr: Erreur de syntaxeu202F: mauvais paramètre pour «u202Fimportu202F» dans {0}

source: Error: import of {0} in {2} failed: '{1}'.
fr: Erreuru202F: l’import de {0} depuis {2} a échouéu202F: «u202F{1}u202F».

source: Error: import: absolute paths are not supported in this version (in '{0}')'
fr: Erreuru202F: importu202F: les chemins absolus ne sont pas pris en charge dans cette version (depuis «u202F{0}u202F»).

source: Mode:
fr: Modeu202F:

source: Execute Program
fr: Lancer le programme

source: Design
fr: Dessin

source: Program
fr: Programme

source: Automaton code
fr: Code de l’automate

source: Open
fr: Ouvrir

source: Save
fr: Enregistrer

source: Save As
fr: Enregistrer sous

source: Automaton:
fr: Automateu202F:

source: Program:
fr: Programmeu202F:

source: Export
fr: Exporter

source: Redraw
fr: Redessiner

source: Run a word
fr: Exécuter un mot

source: Export result
fr: Exporter le résultat

source: Automaton n°
fr: Automate n°

source: result.txt
fr: resultat.txt

source: automaton.txt
fr: automate.txt

source: Word:
fr: Motu202F:

source: Run
fr: Exécuter

source: Step
fr: Un pas

source: Delay between steps (ms):
fr: Pause entre les étapes (ms)u202F:

source: Edit this automaton
fr: Éditer cet automate

source: To add a new state, double-click on the drawing area where you want it to be.
fr: Pour ajouter un nouvel état, double-cliquez sur la surface de dessin à l’endroit où vous voulez le placer.

source: To add a new transition, Shift+click on the start state then click on the destination state.<br /><a href='#' onclick='return helpSymbols()'>Show how to input symbols</a>.
fr: Pour ajouter une nouvelle transition, cliquez sur l’état de départ en appuyant sur Maj puis cliquez sur l’état de destination.<br /><a href='#' onclick='return helpSymbols()'>Montrer l’aide sur comment saisir les symboles</a>.

source: To rename a state, double-click on it.
fr: Pour renommer un état, double-cliquez dessus.

source: To modify symbols of a transition, double-click on its label.<br /><a href='#' onclick='return helpSymbols()'>Show how to input symbols</a>.
fr: Pour modifier les symboles d’une transition, double-cliquez sur son étiquette.<br /><a href='#' onclick='return helpSymbols()'>Montrer l’aide sur comment saisir les symboles</a>.

source: To remove a state, Ctrl+click on it.
fr: Pour supprimer un état, cliquez dessus en maintenant Ctrl enfoncé.

source: To remove a transition, Ctrl+click on its arrow.
fr: Pour supprimer une transition, cliquez sur sa flèche en maintenant Ctrl enfoncé.

source: To set a state as (non-)accepting, right-click on it.
fr: Pour rendre un état (non-)accepteur, cliquez droit sur celui-ci.

source: To set a state as the initial state, Ctrl+right-click on it.
fr: Pour rendre un état initial, ctrl+cliquez dessus avec le bouton droit de la souris.

source: To make a transition straight, Shift+click on its arrow or its label.
fr: Pour rendre une transition droite, cliquez sur sa flèche ou son étiquette avec la touche Shift enfoncée.

source: New state
fr: Nouvel état

source: New transition
fr: Nouvelle transition

source: Modify state's name
fr: Modifier le nom d’un état

source: Modify transitions' symbols
fr: Modifier les symboles d’une transition

source: Remove a state
fr: Supprimer un état

source: Remove a transition
fr: Supprimer une transition

source: Toggle accepting/non accepting
fr: Changer accepteur/non accepteur

source: Set a state as initial
fr: Rendre un état initial

source: Make a transition straight
fr: Rendre une transition droite

source: Toggle help
fr: Afficher / Masquer l’aide

source: Howto: input symbols
fr: Comment saisir des symboles

source: <p>In the window which will invite you to input symbols, simply enter the symbol you want to attach to the transition.</p><p>If you want to attach more than one symbol, separate them with commas.</p><p>If you want to input symbols containing spaces or commas, surround them with double quotes.</p><p>If you need to input a symbol containing double-quotes or slashes, put a slash behind them and surround the symbol with double-quotes.</p><p>to insert an epsilon (ε-transition), you can input it directly or use <code>\e</code></p>
fr: <p>Dans la fenêtre qui vous proposera de saisir des symboles, entrez simplement le symbole que vous voulez associer à la transition.</p><p>Si vous voulez saisir plusieurs symboles, séparez-les par des virgules.</p><p>Si vous voulez saisir des symboles contenant des espaces ou des virgules, encadrez-les par des guillemets doubles.</p><p>Si vous avez besoin de saisir un symbole contenant des guillemets ou des slashs, précédez ces deux caractères par un slash et encadrez le symbole par des guillemets.</p><p>Pour insérer un epsilon (ε-transition), vous pouvez le saisir directement ou utiliser <code>\e</code>.</p>

source: Create a new automaton
fr: Créer un nouvel automate

source: Remove current automaton
fr: Supprimer cet automate

source: There is no automaton to save.
fr: Il n’y a pas d’automate à enregistrer.

source: Automaton
fr: Automate

source: Determinize
fr: Déterminiser

source: Simplify names of the states
fr: Simplifier les noms des états

source: ε-eliminate
fr: ε-éliminer

source: Minimize
fr: Minimiser

source: Complicate
fr: Compliquer

source: Mutate
fr: Muter

source: List differentiable states
fr: Lister les état distingables

source: List the reachable states
fr: Lister les états accessibles

source: List the co-reachable states
fr: Lister les états coaccessibles

source: Test empty language
fr: Tester language vide

source: Test infinite language
fr: Tester language infini

source: Moore machine → Mealy machine
fr: Machine de Moore → machine de Mealy

source: Mealy machine → Moore machine
fr: Machine de Mealy → machine de Moore

source: Complicate the current automaton by choosing one or more of the following options 1 - Add a non reachable state 2 - Add a transition between two not co-reachable states 3 - Add a transition to a non co-reachable state 4 - Copy transitions
fr: Compliquer l’automate courant en choisssant une ou plusieurs des options suivantes : 1 - Ajouter un état non-accessible 2 - Ajouter une transition entre deux états non co-accessibles 3 - Ajouter une transition vers un état non co-accessible 4 - Copier des transitions

source: Transform the current automaton by choosing one or more of the following options: 1 - Change a symbol 2 - Remove a transition 3 - Add a transition 4 - Add a state and some transitions 5 - Inverse a transition 6 - Rename states 7 - Make a state non accepting 8 - Remove an epsilon transition 9 - Remove a state 10 - Make a state accepting
fr: Transformez l’automate courant en choisissant une ou plusieurs options parmis les suivantes : 1 - Changer un symbole 2 - Supprimer une transition 3 - Ajouter une transition 4 - Ajouter un état et des transitions 5 - Inverser une transition 6 - Renommer les états 7 - Rendre un état non-accepteur 8 - Supprimer des epsilon-transitions 9 - Supprimer un état 10 - Rendre un état accepteur

source: JSON representation
fr: Représentation JSON

source: Table representation
fr: Représentation en tableau

source: Load a Quiz
fr: Charger un Quiz

source: Loading the quiz failed
fr: Erreur lors du chargement du Quiz

source: The quiz seems to be malformed: {0}
fr: Le quiz semble mal forméu202F: {0}

source: Start the Quiz
fr: Démarrer le quiz

source: Close the Quiz
fr: Fermer le quiz

source: Close
fr: Fermer

source: Quiz:
fr: Quizu202F:

source: Question {0}:
fr: Question {0}u202F:

source: Next question
fr: Question suivante

source: Previous question
fr: Question précédente

source: The Quiz is finished! Here are the details of the correction.
fr: Le quiz est terminéu202F! Voici les détails de la correction.

source: Error in the Quiz
fr: Erreur dans le quiz

source: There is an error in the Quiz: {0}
fr: Il y a une erreur dans le quizu202F: {0}

source: Question {0} has no answers.
fr: La question {0} n’a pas de réponse.

source: You can draw the automaton bellow.
fr: Vous pouvez dessiner l’automate ci-dessous.

source: Equiv. between 2 automata
fr: Équiv. entre 2 automates

source: Reg. Exp. → automaton
fr: Exp. Reg. → automate

source: Reg. Exp. → minimized automaton
fr: Exp. Reg. → automate minimisé

source: Automaton → Reg. Exp.
fr: Automate → Exp. Reg.

source: Complete
fr: Compléter

source: Complement
fr: Complémenter

source: Product
fr: Produit

source: Mirror
fr: Miroir

source: Wrong answer for {0}.
fr: Réponse incorrecte pour {0}.

source: The given automaton accepts too many words.
fr: L’automate donné accepte trop de mots.

source: The empty word is accepted while it shouldn’t be.
fr: Le mot vide est accepté alors qu’il ne devrait pas l’être.

source: The empty word is not accepted while it should be.
fr: Le mot vide n’est pas accepté alors qu’il devrait l’être.

source: Word <i>{0}</i> is accepted while it shouldn’t be.
fr: Le mot <i>{0}</i> est accepté alors qu’il ne devrait pas l’être.

source: Word <i>{0}</i> is not accepted while it should be.
fr: Le mot <i>{0}</i> n’est pas accepté alors qu’il devrait l‘être.

source: The given automaton isn’t equivalent to the expected one.
fr: L’automate donné n’est pas équivalent à l’automate attendu.

source: The given regular expression isn’t equivalent to the expected one.
fr: L’expression régulière donnée n’est pas équivalent à l’automate attendu.

source: The given automaton isn’t determinized.
fr: L’automate donné n’est pas déterminisé

source: The given automaton isn’t minimized.
fr: L’automate donné n’est pas minimisé.

source: The given automaton isn’t complete.
fr: L’automate donné n’est pas complet.

source: Question type not known
fr: Type de question inconnu

source: Type of question {0} is not known. Known types are: <ul><li>"mcq" for multiple choices question,</li><li>"word" (to draw an automaton which accepts a given list of words).</li></ul>
fr: Le type de la question {0} est inconnu. Les types reconnus sontu202F: <ul><li>"mcq" pour question à choix multiples,</li><li>"word" (pour dessiner un automate qui accepte une liste donnée de mots).</li></ul>

source: Question was not answered.
fr: Vous n’avez pas répondu à la question.

source: We are willing to don’t give you any mark. Your progress is the most important thing, above any arbitrary absolute meaningless mark. Keep your efforts ;-)
fr: Nous souhaitons ne pas vous donner de note. Votre progression est la chose la plus importante, au delà de toute note arbitraire, absolue et dénuée de sens. Continuez vos effortsu202F;-)

source: Correct answer?
fr: Réponse correcteu202F?

source: Comments
fr: Commentaires

source: Instruction
fr: Énoncé

source: Yes
fr: Oui

source: No
fr: Non

source: Previous page
fr: Page précédente

source: Automaton given in the quiz is not correct.
fr: L’automate donné dans le quiz n’est pas correct.

source: Regular expression given in the quiz is not valid.
fr: L’expression régulière donnée dans le quiz n’est pas valide.

source: No automaton or regular expression was given in the quiz.
fr: Aucun automate ou aucune expression régulière n’a été donné dans le quiz.

source: Select an algo
fr: Choisir un algo

source: You didn’t select enough automata. Please select {0} automata.
fr: Vous n’avez pas sélectionné assez d’automates. Veuillez en sélectionner {0}.

source: Automaton #{0}
fr: Automate n°{0}

source: You can choose the order in which automata will be used in algorithms.
fr: Vous pouvez choisir l’ordre dans lequel les automates seront utilisés dans les algorithmes.

source: Continue execution
fr: Continuer l’exécution

source: The algorithm you want to use needs {0} automata. Please select these automata in the order you want and click "Continue execution" when you are ready.
fr: L’algorithme que vous voulez utiliser requiert {0} automates. Veuillez sélectionner ces automates dans l’ordre que vous voulez et cliquez sur «u202FContinuer l’exécutionu202F» quand vous avez fait votre choix.

source: This order will be used for future algorithm executions. If you want to change this order, you can call this list using the <img src="{0}" /> toolbar icon.<br />Notice: Algorithms taking only one automaton work with the current automaton, they don’t use this ordering.
fr: Cet ordre sera utilisé pour les exécutions d’algorithme futures. Si vous voulez changer cet ordre, vous pouvez rappeler cette liste en utilisant l’icône <img src="{0}" /> de la barre d’outils.<br />Noteu202F: Les algorithmes qui ne prennent qu’un automate travaillent sur l’automate courant, ils n’utilisent pas cet ordre.

source: The file was not found or you don't have enough permissions to read it. (HTTP status: {0})
fr: Le fichier n’a pas été trouvé ou vous n’avez pas le droit de le lire (status HTTPu202F: {0})

source: Unable to get the list of predefined algorithms
fr: Impossible d’avoir la liste des algorithmes prédéfinis

source: Ready to use quizzes
fr: Quiz prêts à être utilisés

source: Built-in algorithms
fr: Algorithmes intégrés

source: Examples of automaton
fr: Exemples d’automate

source: Load a quiz
fr: Ouvrir un quiz

source: Load a program
fr: Ouvrir un programme

source: Load an automaton
fr: Ouvrir un automate

source: Loading program failed.
fr: L’ouverture du programme a échoué

source: Loading automaton failed.
fr: L’ouverture de l’automate a échoué.

source: Loading quiz failed.
fr: L’ouverture du quiz a échoué.

source: From your computer
fr: Depuis votre ordinateur

source: Choose and order the parameter automata
fr: Choisir et ordonner les automates paramètres

source: Order the parameter automata
fr: Ordonner les automates paramètres

source: <h2>Welcome to {0}!</h2><h3> Never used {0} before? </h3><ul> <li>Create your first automaton by clicking on the <strong>New state</strong> button at the bottom left of the screen.</li> <li>You can apply an algorithm on your automaton with the <strong>Select an algo</strong> toolbar button.</li></ul><h3> Using a keyboard and a mouse? You can be faster. </h3><ul> <li>To add a <strong>new state</strong>, double-click where you want the state to be.</li> <li>To add a <strong>new transition</strong>, Shift+click on the start state then click on the destination state.</li> <li>To <strong>rename</strong> a state, to <strong>modify symbols</strong> of a transition, double-click on it.</li> <li>To set a state as the <strong>initial</strong> state, ctrl+right click on the state.</li> <li>To set a state as <strong>(non-)accepting</strong>, right-click on it.</li> <li>To <strong>remove</strong> a state or a transition, ctrl-click on it.</li></ul>
fr: <h2>Bienvenue sur {0} !</h2><h3> Vous n’avez encore jamais utilisé {0} ? </h3>

source: <h3> Quizzes </h3><p>To load a quiz, click on the "Load a Quiz" toolbar button. You can keep on using all the features of the program, like running algorithms, during the quiz whenever it is possible to draw an automaton.</p><p> Now it’s your turn!</p>
fr: <h3> Quiz </h3><p>Pour ouvrir un quiz, cliquez sur le bouton "Charger un Quiz" de la barre d’outils. Vous pouvez continuer à utiliser toutes les fonctionnalités du programme, comme lancer des algorithmes, pendant le quiz à tout moment lorsqu’il est possible de dessiner un automate.</p><p>Pour faire disparaître ce texte, cliquez dessus.</p><p> À vous de joueru202F!</p>

source: Unable to access the code of automaton n°{0}
fr: Impossible d’accéder au code de l’automate n°{0}

source: You need to fix the automaton in design mode before accessing its code.
fr: Vous devez corriger l’automate dans le mode dessin avant d’accéder à son code.

source: Zoom and center automatically
fr: Zoomer et centrer automatiquement

source: Undo
fr: Annuler

source: Redo
fr: Refaire

source: Add a question
fr: Ajouter une question

source: Edit or Create a Quiz
fr: Éditer ou créer un quiz

source: Example: Which of the following assertions are correct? (check the correct answers)
fr: Example : Parmi ces assertions, lesquelles sont correctes ? (cochez les réponses correctes)

source: Example: For the following languages, give an automaton that recognizes it (if such an automaton exists).
fr: Exemple : Pour les langages suivants, donnez un automate qui les reconnaît (si un tel automate existe).

source: Example: For the following minimal automaton, give a regular expression that is equivalent.
fr: Example : Pour l’automate minimal suivant, donnez une expression régulière équivalente.

source: Multiple Choice Question
fr: Question à Choix Multiples

source: Find an automaton
fr: Trouver un automate

source: Find a regular expression
fr: Trouver une expression régulière

source: Search…
fr: Chercher…

source: Close the Quiz Editor
fr: Fermer l’éditeur de quiz

source: Answers
fr: Réponses

source: Answer
fr: Réponse

source: Edit
fr: Modifier

source: Nb
fr: N°

source: Quiz Editor
fr: Éditeur de quiz

source: New quiz
fr: Nouveau quiz

source: Do you really want to start a new quiz from scratch?
fr: Voulez-vous vraiment commencer un nouveau quiz ?

source: Do you really want to abandon your modifications to the quiz?
fr: Voulez-vous vraiment abandonnez vos modifications au quiz ?

source: Write the different possible answers and check the correct ones.
fr: Écrivez les différentes réponses possibles et cochez celles qui sont correctes.

source: Choice {0}…
fr: Choix {0}…

source: New Question
fr: Nouvelle question

source: Add
fr: Ajouter

source: Add an answer
fr: Ajouter une réponse

source: Validate
fr: Valider

source: Show the quiz overview
fr: Afficher le quiz

source: Quiz Overview
fr: Vue d’ensemble du quiz

source: January
fr: janvier

source: February
fr: février

source: March
fr: mars

source: April
fr: avril

source: May
fr: mai

source: June
fr: juin

source: July
fr: juillet

source: August
fr: août

source: September
fr: septembre

source: October
fr: octobre

source: November
fr: novembre

source: December
fr: décembre

source: Quiz title:
fr: Titre du quiz :

source: Your name:
fr: Votre nom :

source: There is no question in this quiz yet. Click on the button bellow to add a new question.
fr: Il n’y a pas encore de question dans ce quiz. Cliquez sur le bouton ci-dessous pour ajouter une nouvelle question.

source: Write your question…
fr: Écrivez votre question…

source: Write a regular expression…
fr: Écrivez une expression régulière…

source: Draw an automaton
fr: Dessiner un automate

source: Automaton answer
fr: Automate réponse

source: Write your audescript code here…
fr: Écrivez votre code audescript ici…

source: Write the regular expression…
fr: Écrivez l’expression régulière…

source: Loading…
fr: Chargement…

source: Your regular expression is going to be checked.
fr: Votre expression régulière va être vérifiée.

source: This regular expresion does not seem valid.
fr: Cette expression régulière ne semble pas valide.

source: Recognized operations: “.”, “*”, “+”.
fr: Opérations reconnues: «u202F.u202F», «u202F*u202F», «u202F+u202F».

source: If you want the automaton answer to be:
fr: Si vous voulez que l’automate réponse soit:

source: determinized, write isDeterminized(autoAnsw)
fr: determinisé, écrivez isDeterminized(autoAnsw)

source: minimized, write isMinimized(autoAnsw)
fr: minimisé, écrivez isMinimized(autoAnsw)

source: completed, write isCompleted(autoAnsw)
fr: complété, écrivez isCompleted(autoAnsw)

source: Initial stack symbol :
fr: Symbole de fond de pile:

source: Determinized pushdown automaton:
fr: Automate à pile déterminisé

source: State:
fr: Etat :

source: Stacks
fr: Piles

source: Index
fr: Indice

source: Value
fr: Valeur

source: Stack
fr: Pile

source: Write directly the grammar:
fr: Entrer directement la grammaire

source: Or enter easily the grammar:
fr: Ou entrer la grammaire champ par champ

source: Write the terminal symbols:
fr: Ecriver les symboles terminaux :

source: Write the non terminal symbols:
fr: Ecriver les symboles non terminaux :

source: Select the start symbol
fr: Sélectionner l'axiome

source: Non terminal symbol
fr: Symbole non terminal

source: Body
fr: Le corps

source: Choose the entry of the algorithm:
fr: Choisissez le type d'entrée de l'algorithme

source: Choose type
fr: Choisir le type

source: Enter a grammar
fr: Entrer la grammar

source: Deterministic automaton
fr: Automate déterministe

source: Non deterministic automaton
fr: Automate non déterministe

source: Non deterministic automaton with ε-transitions
fr: Automate non déterministe avec ε-transitions

source: Settings automaton
fr: Options de l'automate

source: Create the complementary automaton of the following automaton
fr: Dessiner l'automate complémentaire de l'automate suivant

source: Create the complete automaton of the following automaton
fr: Déssiner l'automate complété de l'automate suivant

source: Do the product of the following automata
fr: Dessiner le produit des 2 automates suivant

source: Minimize the following automaton
fr: Minimiser l'automate suivant

source: Write the equivalent states of the following automaton
fr: Ecriver la liste des états équivalents de l'automate suivant

source: Are the following automatons equivalent?
fr: Est-ce que les automates sont équivalents ?

source: Fill the table corresponding to the automaton
fr: Remplisser le tableau correspondant à l'automate

source: Write the reachable states of the following automaton
fr: Lister les états accessibles de l'automate

source: Write the co-reachable states of the following automaton
fr: Lister les états co-accessibles de l'automate

source: Write a word recognized by the following automaton
fr: Ecriver un mot reconnu par l'automate

source: Create the determinized automaton of the following automaton
fr: Dessiner l'automate déterminisé de l'automate suivant

source: Create the determinized and minimize automaton of the following automaton
fr: Dessiner l'automate déterminisé et minimisé de l'automate suivant

source: Eleminate the ε-transitions of the following automaton
fr: Eliminer les ε-transitions de l'automate suivant

source: Eleminate the ε-transitions and determinize the following automaton
fr: Eliminer les ε-transitions et déterminisé de l'automate suivant
